package task5;

public class Answers {
    public static void main(String[] args) {
        String s = (char)27 + "[33m";
        String s1 = (char)27 + "[39m";
        String s2 = (char)27 + "[34m";
        String one = "\tСеріалізація - це процес передання стану об'єкта в потік байтів для збереження його в пам'яті, у базі даних або в файлі.";
        String one1 = "\tОсновне призначення сериалізації - зберегти стан об'єкта для того, щоб мати можливість відновити його за потреби.";
        String one2 = "\tЗворотний процес серіалізації називається десеріалізацією.";
        String two = "\tМіжпроцесна, міждоменна та міжрівнева серіалізація-десеріалізація, називається маршалингом-демаршалингом. ";
        String three = """
                \tXML (eXtensible Markup Language) – мова розмітки, що розширюється (вимовляється [ікс-ем-ель]).
                \tXML – текстовий формат, який призначений для зберігання структурованих даних (замість наявних файлів баз даних), для обміну інформацією між програмами,
                \tа також для створення на його основі спеціалізованих мов розмітки (наприклад, XHTML).""";
        String three1 = "\tHTML - це мова розмітки, яка використовується для розробки веб-сторінок. \n" +
                "\tВін записується в попередньо визначені елементи тегів.";
        String three2 = "\tXML - це мова розмітки, основною метою якої є транспортування та зберігання даних.\n" +
                "\tВін не має заздалегідь визначеного набору тегів і дозволяє розробнику налаштовувати теги.";
        String four = "\tПарсери в XML - Dom Parser , SAX Parser, StAX Parser. Існують ще й інші. Із зазначеними Парсерами вже озайомлені. Інші вивчимо додатково.";
        String four1 = "\tDom Parser – аналізує XML-документ, загружаючи весь зміст документу і створює його повне ієрархічне дерево в пам'яті.";
        String four2 = "\tSAX Parser – аналізує XML-документ по тригерам на основі подій. Не загружає повний документ у пам'ять.";
        String four3 = "\tStAX Parser – аналізує XML-документ аналогічно SAX Parser. Існує думка, що його спосіб більш ефективний.";
        String five = "\tJSON - (англ. JavaScript Object Notation) – текстовий формат обміну даними, що ґрунтується на JavaScript і зазвичай використовується саме з цією мовою.\n"
                +"\tЯк і багато інших текстових форматів, JSON легко читається людьми.";
        String six  = "\tJAXB - Java Architecture for XML Binding (JAXB) дає змогу розробникам ставити у відповідність Java-класи та XML-представлення.";
        System.out.println(s +"Що таке Серіалізація/десеріалізація?" + s1 +"\n" + one + "\n" + one1 + "\n" + one2   );
        System.out.println(s2 +"Що таке Маршаллінг/демаршаллінг?\n" +s1+ two );
        System.out.println(s +"Розкажіть про XML, у чому різниця між HTML" + s1+ "\n" +three + three1 + three2 );
        System.out.println(s2 +"Які парсери в XML знаєте?" + s1 +"\n" + four  + "\n" + four1  + "\n" + four2+ "\n" + four3  );
        System.out.println(s + "Що робить JSON?"+ s1 +"\n" + five );
        System.out.println(s2 +"Що таке JAXB?"+s1 +"\n"+ six );


    }
}

